Can't create dimension. Highlighted references are not parallel to first selection.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateDimensionNotParallel { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateDimensionNotParallel As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateDimensionNotParallel {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace